app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `email_verified_at`, `password`, `remember_token`, `updated_at`, `created_at`) values ('Duong Nood', 'abcde@example.com', null, '$2y$12$rFl01nM0sYnygSiH5qHE9exHdQXnFCaFo2tIQjXDPCNRVBzCmbT.K', 'BqRmIzl6wF', '2025-02-20 18:20:23', '2025-02-20 18:20:23')
---
    public function register(Request $request)
    {
        // Xác thực dữ liệu đầu vào
        $validator = Validator::make($request->all(), [
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:users',
            'email_verified_at' => 'nullable|date',
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
            'remember_token' => 'nullable|string|max:100',
            'created_at' => 'nullable|date',
            'updated_at' => 'nullable|date',
        ]);

        if ($validator->fails()) {
            return response()->json([
                'message' => 'Dữ liệu không hợp lệ',
                'errors' => $validator->errors()
            ], 422);
        }

        // Tạo user mới
        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'email_verified_at' => $request->email_verified_at,
            'password' => Hash::make($request->password),
            'remember_token' => $request->remember_token ?? Str::random(10),
            'created_at' => $request->created_at ?? now(),
            'updated_at' => $request->updated_at ?? now(),
        ]);